scripts/fio/results/hdd_20260402_191721.txt
seq_write: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=32
...
seq_read: (g=1): rw=read, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=32
...
rand_write_4k: (g=2): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
...
rand_read_4k: (g=3): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
...
fio-3.28
Starting 16 processes
seq_write: Laying out IO file (1 file / 1024MiB)
seq_write: Laying out IO file (1 file / 1024MiB)
seq_write: Laying out IO file (1 file / 1024MiB)
[...]
seq_read: Laying out IO file (1 file / 1024MiB)
seq_read: Laying out IO file (1 file / 1024MiB)
seq_read: Laying out IO file (1 file / 1024MiB)
[...]
rand_write_4k: Laying out IO file (1 file / 1024MiB)
rand_write_4k: Laying out IO file (1 file / 1024MiB)
rand_write_4k: Laying out IO file (1 file / 1024MiB)
[...]
rand_read_4k: Laying out IO file (1 file / 1024MiB)


Run status group 0 (all jobs):

Run status group 1 (all jobs):

Run status group 2 (all jobs):

Run status group 3 (all jobs):
rand_read_4k: Laying out IO file (1 file / 1024MiB)
rand_read_4k: Laying out IO file (1 file / 1024MiB)
rand_read_4k: Laying out IO file (1 file / 1024MiB)

seq_write: (groupid=0, jobs=4): err= 0: pid=3854281: Thu Apr  2 19:18:53 2026
  write: IOPS=279, BW=279MiB/s (293MB/s)(8372MiB/30008msec); 0 zone resets
    slat (usec): min=6005, max=54346, avg=14325.43, stdev=1821.09
    clat (msec): min=389, max=545, avg=444.52, stdev=10.79
     lat (msec): min=403, max=558, avg=458.85, stdev=10.97
    clat percentiles (msec):
     |  1.00th=[  426],  5.00th=[  435], 10.00th=[  439], 20.00th=[  439],
     | 30.00th=[  443], 40.00th=[  443], 50.00th=[  443], 60.00th=[  443],
     | 70.00th=[  447], 80.00th=[  447], 90.00th=[  451], 95.00th=[  460],
     | 99.00th=[  493], 99.50th=[  514], 99.90th=[  542], 99.95th=[  542],
     | 99.99th=[  542]
   bw (  KiB/s): min=247808, max=299310, per=100.00%, avg=285739.98, stdev=1839.19, samples=236
   iops        : min=  242, max=  292, avg=278.98, stdev= 1.79, samples=236
  lat (msec)   : 500=99.02%, 750=0.93%
  cpu          : usr=0.36%, sys=2.82%, ctx=386752, majf=0, minf=233
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,8376,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=279MiB/s (293MB/s), 279MiB/s-279MiB/s (293MB/s-293MB/s), io=8372MiB (8779MB), run=30008-30008msec

Run status group 1 (all jobs):

Run status group 2 (all jobs):

Run status group 3 (all jobs):

seq_write: (groupid=0, jobs=4): err= 0: pid=3854281: Thu Apr  2 19:19:23 2026
  write: IOPS=278, BW=280MiB/s (293MB/s)(16.4GiB/60009msec); 0 zone resets
    slat (msec): min=6, max=127, avg=14.34, stdev= 2.42
    clat (usec): min=5, max=626112, avg=443257.52, stdev=27912.65
     lat (msec): min=6, max=639, avg=457.60, stdev=28.09
    clat percentiles (msec):
     |  1.00th=[  409],  5.00th=[  435], 10.00th=[  439], 20.00th=[  439],
     | 30.00th=[  443], 40.00th=[  443], 50.00th=[  443], 60.00th=[  443],
     | 70.00th=[  447], 80.00th=[  447], 90.00th=[  451], 95.00th=[  456],
     | 99.00th=[  514], 99.50th=[  584], 99.90th=[  625], 99.95th=[  625],
     | 99.99th=[  625]
   bw (  KiB/s): min=225280, max=301505, per=99.64%, avg=285417.84, stdev=2220.73, samples=476
   iops        : min=  220, max=  294, avg=278.66, stdev= 2.16, samples=476
  lat (usec)   : 10=0.02%, 20=0.01%
  lat (msec)   : 10=0.01%, 20=0.02%, 50=0.05%, 100=0.08%, 250=0.26%
  lat (msec)   : 500=99.09%, 750=1.21%
  cpu          : usr=0.36%, sys=2.79%, ctx=764416, majf=0, minf=250
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,16722,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=280MiB/s (293MB/s), 280MiB/s-280MiB/s (293MB/s-293MB/s), io=16.4GiB (17.6GB), run=60009-60009msec

Run status group 1 (all jobs):

Run status group 2 (all jobs):

Run status group 3 (all jobs):

seq_write: (groupid=0, jobs=4): err= 0: pid=3854281: Thu Apr  2 19:19:59 2026
  write: IOPS=175, BW=176MiB/s (185MB/s)(16.5GiB/95491msec); 0 zone resets
    slat (msec): min=6, max=127, avg=14.34, stdev= 2.42
    clat (usec): min=5, max=626112, avg=443257.52, stdev=27912.65
     lat (msec): min=6, max=639, avg=457.60, stdev=28.09
    clat percentiles (msec):
     |  1.00th=[  409],  5.00th=[  435], 10.00th=[  439], 20.00th=[  439],
     | 30.00th=[  443], 40.00th=[  443], 50.00th=[  443], 60.00th=[  443],
     | 70.00th=[  447], 80.00th=[  447], 90.00th=[  451], 95.00th=[  456],
     | 99.00th=[  514], 99.50th=[  584], 99.90th=[  625], 99.95th=[  625],
     | 99.99th=[  625]
   bw (  KiB/s): min=225280, max=384980, per=100.00%, avg=286155.25, stdev=3613.06, samples=478
   iops        : min=  220, max=  375, avg=279.37, stdev= 3.51, samples=478
  lat (usec)   : 10=0.02%, 20=0.01%
  lat (msec)   : 10=0.01%, 20=0.02%, 50=0.05%, 100=0.08%, 250=0.26%
  lat (msec)   : 500=99.09%, 750=1.21%
  cpu          : usr=0.22%, sys=1.75%, ctx=764597, majf=0, minf=252
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,16722,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
seq_read: (groupid=1, jobs=4): err= 0: pid=3855468: Thu Apr  2 19:19:59 2026
  read: IOPS=246, BW=246MiB/s (258MB/s)(7377MiB/30040msec)
    slat (msec): min=5, max=185, avg=16.24, stdev=14.30
    clat (msec): min=311, max=869, avg=504.55, stdev=87.46
     lat (msec): min=322, max=886, avg=520.77, stdev=89.11
    clat percentiles (msec):
     |  1.00th=[  342],  5.00th=[  380], 10.00th=[  401], 20.00th=[  430],
     | 30.00th=[  451], 40.00th=[  472], 50.00th=[  498], 60.00th=[  518],
     | 70.00th=[  542], 80.00th=[  575], 90.00th=[  617], 95.00th=[  667],
     | 99.00th=[  768], 99.50th=[  802], 99.90th=[  860], 99.95th=[  869],
     | 99.99th=[  869]
   bw (  KiB/s): min=143360, max=348160, per=100.00%, avg=251760.68, stdev=10216.94, samples=236
   iops        : min=  140, max=  340, avg=245.81, stdev= 9.98, samples=236
  lat (msec)   : 500=51.95%, 750=46.68%, 1000=1.31%
  cpu          : usr=0.09%, sys=10.83%, ctx=3690395, majf=0, minf=234
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=7397,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=176MiB/s (185MB/s), 176MiB/s-176MiB/s (185MB/s-185MB/s), io=16.5GiB (17.7GB), run=95491-95491msec

Run status group 1 (all jobs):
   READ: bw=246MiB/s (258MB/s), 246MiB/s-246MiB/s (258MB/s-258MB/s), io=7377MiB (7735MB), run=30040-30040msec

Run status group 2 (all jobs):

Run status group 3 (all jobs):

seq_write: (groupid=0, jobs=4): err= 0: pid=3854281: Thu Apr  2 19:20:29 2026
  write: IOPS=133, BW=134MiB/s (141MB/s)(16.5GiB/125491msec); 0 zone resets
    slat (msec): min=6, max=127, avg=14.34, stdev= 2.42
    clat (usec): min=5, max=626112, avg=443257.52, stdev=27912.65
     lat (msec): min=6, max=639, avg=457.60, stdev=28.09
    clat percentiles (msec):
     |  1.00th=[  409],  5.00th=[  435], 10.00th=[  439], 20.00th=[  439],
     | 30.00th=[  443], 40.00th=[  443], 50.00th=[  443], 60.00th=[  443],
     | 70.00th=[  447], 80.00th=[  447], 90.00th=[  451], 95.00th=[  456],
     | 99.00th=[  514], 99.50th=[  584], 99.90th=[  625], 99.95th=[  625],
     | 99.99th=[  625]
   bw (  KiB/s): min=225280, max=384980, per=100.00%, avg=286155.25, stdev=3613.06, samples=478
   iops        : min=  220, max=  375, avg=279.37, stdev= 3.51, samples=478
  lat (usec)   : 10=0.02%, 20=0.01%
  lat (msec)   : 10=0.01%, 20=0.02%, 50=0.05%, 100=0.08%, 250=0.26%
  lat (msec)   : 500=99.09%, 750=1.21%
  cpu          : usr=0.17%, sys=1.33%, ctx=764597, majf=0, minf=252
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,16722,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
seq_read: (groupid=1, jobs=4): err= 0: pid=3855468: Thu Apr  2 19:20:29 2026
  read: IOPS=246, BW=248MiB/s (260MB/s)(14.6GiB/60040msec)
    slat (msec): min=5, max=185, avg=16.19, stdev=14.71
    clat (usec): min=3, max=910787, avg=500535.48, stdev=95630.70
     lat (msec): min=6, max=923, avg=516.73, stdev=97.36
    clat percentiles (msec):
     |  1.00th=[  326],  5.00th=[  372], 10.00th=[  393], 20.00th=[  422],
     | 30.00th=[  447], 40.00th=[  468], 50.00th=[  493], 60.00th=[  514],
     | 70.00th=[  542], 80.00th=[  575], 90.00th=[  625], 95.00th=[  667],
     | 99.00th=[  768], 99.50th=[  802], 99.90th=[  844], 99.95th=[  869],
     | 99.99th=[  902]
   bw (  KiB/s): min=139264, max=356352, per=99.43%, avg=252716.58, stdev=10785.48, samples=476
   iops        : min=  136, max=  348, avg=246.74, stdev=10.53, samples=476
  lat (usec)   : 4=0.01%, 10=0.02%
  lat (msec)   : 10=0.01%, 20=0.02%, 50=0.05%, 100=0.10%, 250=0.25%
  lat (msec)   : 500=53.26%, 750=45.66%, 1000=1.45%
  cpu          : usr=0.07%, sys=9.34%, ctx=8084381, majf=0, minf=257
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=14806,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=134MiB/s (141MB/s), 134MiB/s-134MiB/s (141MB/s-141MB/s), io=16.5GiB (17.7GB), run=125491-125491msec

Run status group 1 (all jobs):
   READ: bw=248MiB/s (260MB/s), 248MiB/s-248MiB/s (260MB/s-260MB/s), io=14.6GiB (15.6GB), run=60040-60040msec

Run status group 2 (all jobs):

Run status group 3 (all jobs):

seq_write: (groupid=0, jobs=4): err= 0: pid=3854281: Thu Apr  2 19:21:04 2026
  write: IOPS=103, BW=105MiB/s (110MB/s)(16.5GiB/160909msec); 0 zone resets
    slat (msec): min=6, max=127, avg=14.34, stdev= 2.42
    clat (usec): min=5, max=626112, avg=443257.52, stdev=27912.65
     lat (msec): min=6, max=639, avg=457.60, stdev=28.09
    clat percentiles (msec):
     |  1.00th=[  409],  5.00th=[  435], 10.00th=[  439], 20.00th=[  439],
     | 30.00th=[  443], 40.00th=[  443], 50.00th=[  443], 60.00th=[  443],
     | 70.00th=[  447], 80.00th=[  447], 90.00th=[  451], 95.00th=[  456],
     | 99.00th=[  514], 99.50th=[  584], 99.90th=[  625], 99.95th=[  625],
     | 99.99th=[  625]
   bw (  KiB/s): min=225280, max=384980, per=100.00%, avg=286155.25, stdev=3613.06, samples=478
   iops        : min=  220, max=  375, avg=279.37, stdev= 3.51, samples=478
  lat (usec)   : 10=0.02%, 20=0.01%
  lat (msec)   : 10=0.01%, 20=0.02%, 50=0.05%, 100=0.08%, 250=0.26%
  lat (msec)   : 500=99.09%, 750=1.21%
  cpu          : usr=0.13%, sys=1.04%, ctx=764597, majf=0, minf=252
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,16722,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
seq_read: (groupid=1, jobs=4): err= 0: pid=3855468: Thu Apr  2 19:21:04 2026
  read: IOPS=155, BW=156MiB/s (164MB/s)(14.6GiB/95458msec)
    slat (msec): min=5, max=185, avg=16.19, stdev=14.71
    clat (usec): min=3, max=910787, avg=500535.48, stdev=95630.70
     lat (msec): min=6, max=923, avg=516.73, stdev=97.36
    clat percentiles (msec):
     |  1.00th=[  326],  5.00th=[  372], 10.00th=[  393], 20.00th=[  422],
     | 30.00th=[  447], 40.00th=[  468], 50.00th=[  493], 60.00th=[  514],
     | 70.00th=[  542], 80.00th=[  575], 90.00th=[  625], 95.00th=[  667],
     | 99.00th=[  768], 99.50th=[  802], 99.90th=[  844], 99.95th=[  869],
     | 99.99th=[  902]
   bw (  KiB/s): min=139264, max=356352, per=100.00%, avg=252716.58, stdev=10785.48, samples=476
   iops        : min=  136, max=  348, avg=246.74, stdev=10.53, samples=476
  lat (usec)   : 4=0.01%, 10=0.02%
  lat (msec)   : 10=0.01%, 20=0.02%, 50=0.05%, 100=0.10%, 250=0.25%
  lat (msec)   : 500=53.26%, 750=45.66%, 1000=1.45%
  cpu          : usr=0.05%, sys=5.88%, ctx=8084437, majf=0, minf=258
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=14806,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
rand_write_4k: (groupid=2, jobs=4): err= 0: pid=3856597: Thu Apr  2 19:21:04 2026
  write: IOPS=6222, BW=24.3MiB/s (25.5MB/s)(729MiB/30002msec); 0 zone resets
    slat (usec): min=118, max=152898, avg=640.37, stdev=1473.42
    clat (msec): min=8, max=216, avg=19.93, stdev=12.49
     lat (msec): min=8, max=217, avg=20.57, stdev=12.79
    clat percentiles (msec):
     |  1.00th=[   10],  5.00th=[   11], 10.00th=[   12], 20.00th=[   13],
     | 30.00th=[   14], 40.00th=[   16], 50.00th=[   17], 60.00th=[   18],
     | 70.00th=[   20], 80.00th=[   23], 90.00th=[   33], 95.00th=[   45],
     | 99.00th=[   69], 99.50th=[   82], 99.90th=[  127], 99.95th=[  163],
     | 99.99th=[  215]
   bw (  KiB/s): min=14072, max=34464, per=100.00%, avg=24916.92, stdev=1318.12, samples=236
   iops        : min= 3518, max= 8616, avg=6229.14, stdev=329.53, samples=236
  lat (msec)   : 10=1.49%, 20=70.67%, 50=24.29%, 100=3.35%, 250=0.20%
  cpu          : usr=0.56%, sys=2.56%, ctx=382856, majf=0, minf=229
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,186687,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=105MiB/s (110MB/s), 105MiB/s-105MiB/s (110MB/s-110MB/s), io=16.5GiB (17.7GB), run=160909-160909msec

Run status group 1 (all jobs):
   READ: bw=156MiB/s (164MB/s), 156MiB/s-156MiB/s (164MB/s-164MB/s), io=14.6GiB (15.7GB), run=95458-95458msec

Run status group 2 (all jobs):
  WRITE: bw=24.3MiB/s (25.5MB/s), 24.3MiB/s-24.3MiB/s (25.5MB/s-25.5MB/s), io=729MiB (765MB), run=30002-30002msec

Run status group 3 (all jobs):

seq_write: (groupid=0, jobs=4): err= 0: pid=3854281: Thu Apr  2 19:21:34 2026
  write: IOPS=87, BW=88.3MiB/s (92.5MB/s)(16.5GiB/190908msec); 0 zone resets
    slat (msec): min=6, max=127, avg=14.34, stdev= 2.42
    clat (usec): min=5, max=626112, avg=443257.52, stdev=27912.65
     lat (msec): min=6, max=639, avg=457.60, stdev=28.09
    clat percentiles (msec):
     |  1.00th=[  409],  5.00th=[  435], 10.00th=[  439], 20.00th=[  439],
     | 30.00th=[  443], 40.00th=[  443], 50.00th=[  443], 60.00th=[  443],
     | 70.00th=[  447], 80.00th=[  447], 90.00th=[  451], 95.00th=[  456],
     | 99.00th=[  514], 99.50th=[  584], 99.90th=[  625], 99.95th=[  625],
     | 99.99th=[  625]
   bw (  KiB/s): min=225280, max=384980, per=100.00%, avg=286155.25, stdev=3613.06, samples=478
   iops        : min=  220, max=  375, avg=279.37, stdev= 3.51, samples=478
  lat (usec)   : 10=0.02%, 20=0.01%
  lat (msec)   : 10=0.01%, 20=0.02%, 50=0.05%, 100=0.08%, 250=0.26%
  lat (msec)   : 500=99.09%, 750=1.21%
  cpu          : usr=0.11%, sys=0.88%, ctx=764597, majf=0, minf=252
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,16722,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
seq_read: (groupid=1, jobs=4): err= 0: pid=3855468: Thu Apr  2 19:21:34 2026
  read: IOPS=118, BW=119MiB/s (125MB/s)(14.6GiB/125458msec)
    slat (msec): min=5, max=185, avg=16.19, stdev=14.71
    clat (usec): min=3, max=910787, avg=500535.48, stdev=95630.70
     lat (msec): min=6, max=923, avg=516.73, stdev=97.36
    clat percentiles (msec):
     |  1.00th=[  326],  5.00th=[  372], 10.00th=[  393], 20.00th=[  422],
     | 30.00th=[  447], 40.00th=[  468], 50.00th=[  493], 60.00th=[  514],
     | 70.00th=[  542], 80.00th=[  575], 90.00th=[  625], 95.00th=[  667],
     | 99.00th=[  768], 99.50th=[  802], 99.90th=[  844], 99.95th=[  869],
     | 99.99th=[  902]
   bw (  KiB/s): min=139264, max=356352, per=100.00%, avg=252716.58, stdev=10785.48, samples=476
   iops        : min=  136, max=  348, avg=246.74, stdev=10.53, samples=476
  lat (usec)   : 4=0.01%, 10=0.02%
  lat (msec)   : 10=0.01%, 20=0.02%, 50=0.05%, 100=0.10%, 250=0.25%
  lat (msec)   : 500=53.26%, 750=45.66%, 1000=1.45%
  cpu          : usr=0.04%, sys=4.47%, ctx=8084437, majf=0, minf=258
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=14806,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
rand_write_4k: (groupid=2, jobs=4): err= 0: pid=3856597: Thu Apr  2 19:21:34 2026
  write: IOPS=6254, BW=24.4MiB/s (25.6MB/s)(1466MiB/60003msec); 0 zone resets
    slat (usec): min=117, max=152898, avg=637.17, stdev=1483.50
    clat (usec): min=2, max=257406, avg=19821.84, stdev=13026.61
     lat (usec): min=276, max=269484, avg=20459.36, stdev=13345.68
    clat percentiles (msec):
     |  1.00th=[   10],  5.00th=[   11], 10.00th=[   12], 20.00th=[   13],
     | 30.00th=[   14], 40.00th=[   15], 50.00th=[   16], 60.00th=[   18],
     | 70.00th=[   20], 80.00th=[   23], 90.00th=[   34], 95.00th=[   46],
     | 99.00th=[   72], 99.50th=[   86], 99.90th=[  132], 99.95th=[  161],
     | 99.99th=[  215]
   bw (  KiB/s): min=13728, max=35240, per=99.84%, avg=24982.82, stdev=1337.42, samples=476
   iops        : min= 3432, max= 8810, avg=6245.55, stdev=334.36, samples=476
  lat (usec)   : 4=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=1.84%, 20=71.58%, 50=22.84%
  lat (msec)   : 100=3.49%, 250=0.27%, 500=0.01%
  cpu          : usr=0.49%, sys=2.43%, ctx=744718, majf=0, minf=247
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,375300,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=88.3MiB/s (92.5MB/s), 88.3MiB/s-88.3MiB/s (92.5MB/s-92.5MB/s), io=16.5GiB (17.7GB), run=190908-190908msec

Run status group 1 (all jobs):
   READ: bw=119MiB/s (125MB/s), 119MiB/s-119MiB/s (125MB/s-125MB/s), io=14.6GiB (15.7GB), run=125458-125458msec

Run status group 2 (all jobs):
  WRITE: bw=24.4MiB/s (25.6MB/s), 24.4MiB/s-24.4MiB/s (25.6MB/s-25.6MB/s), io=1466MiB (1537MB), run=60003-60003msec

Run status group 3 (all jobs):

seq_write: (groupid=0, jobs=4): err= 0: pid=3854281: Thu Apr  2 19:22:10 2026
  write: IOPS=73, BW=74.5MiB/s (78.1MB/s)(16.5GiB/226283msec); 0 zone resets
    slat (msec): min=6, max=127, avg=14.34, stdev= 2.42
    clat (usec): min=5, max=626112, avg=443257.52, stdev=27912.65
     lat (msec): min=6, max=639, avg=457.60, stdev=28.09
    clat percentiles (msec):
     |  1.00th=[  409],  5.00th=[  435], 10.00th=[  439], 20.00th=[  439],
     | 30.00th=[  443], 40.00th=[  443], 50.00th=[  443], 60.00th=[  443],
     | 70.00th=[  447], 80.00th=[  447], 90.00th=[  451], 95.00th=[  456],
     | 99.00th=[  514], 99.50th=[  584], 99.90th=[  625], 99.95th=[  625],
     | 99.99th=[  625]
   bw (  KiB/s): min=225280, max=384980, per=100.00%, avg=286155.25, stdev=3613.06, samples=478
   iops        : min=  220, max=  375, avg=279.37, stdev= 3.51, samples=478
  lat (usec)   : 10=0.02%, 20=0.01%
  lat (msec)   : 10=0.01%, 20=0.02%, 50=0.05%, 100=0.08%, 250=0.26%
  lat (msec)   : 500=99.09%, 750=1.21%
  cpu          : usr=0.09%, sys=0.74%, ctx=764597, majf=0, minf=252
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,16722,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
seq_read: (groupid=1, jobs=4): err= 0: pid=3855468: Thu Apr  2 19:22:10 2026
  read: IOPS=92, BW=92.9MiB/s (97.4MB/s)(14.6GiB/160832msec)
    slat (msec): min=5, max=185, avg=16.19, stdev=14.71
    clat (usec): min=3, max=910787, avg=500535.48, stdev=95630.70
     lat (msec): min=6, max=923, avg=516.73, stdev=97.36
    clat percentiles (msec):
     |  1.00th=[  326],  5.00th=[  372], 10.00th=[  393], 20.00th=[  422],
     | 30.00th=[  447], 40.00th=[  468], 50.00th=[  493], 60.00th=[  514],
     | 70.00th=[  542], 80.00th=[  575], 90.00th=[  625], 95.00th=[  667],
     | 99.00th=[  768], 99.50th=[  802], 99.90th=[  844], 99.95th=[  869],
     | 99.99th=[  902]
   bw (  KiB/s): min=139264, max=356352, per=100.00%, avg=252716.58, stdev=10785.48, samples=476
   iops        : min=  136, max=  348, avg=246.74, stdev=10.53, samples=476
  lat (usec)   : 4=0.01%, 10=0.02%
  lat (msec)   : 10=0.01%, 20=0.02%, 50=0.05%, 100=0.10%, 250=0.25%
  lat (msec)   : 500=53.26%, 750=45.66%, 1000=1.45%
  cpu          : usr=0.03%, sys=3.49%, ctx=8084437, majf=0, minf=258
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=14806,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
rand_write_4k: (groupid=2, jobs=4): err= 0: pid=3856597: Thu Apr  2 19:22:10 2026
  write: IOPS=3934, BW=15.4MiB/s (16.1MB/s)(1467MiB/95377msec); 0 zone resets
    slat (usec): min=117, max=152898, avg=637.17, stdev=1483.50
    clat (usec): min=2, max=257406, avg=19821.84, stdev=13026.61
     lat (usec): min=276, max=269484, avg=20459.36, stdev=13345.68
    clat percentiles (msec):
     |  1.00th=[   10],  5.00th=[   11], 10.00th=[   12], 20.00th=[   13],
     | 30.00th=[   14], 40.00th=[   15], 50.00th=[   16], 60.00th=[   18],
     | 70.00th=[   20], 80.00th=[   23], 90.00th=[   34], 95.00th=[   46],
     | 99.00th=[   72], 99.50th=[   86], 99.90th=[  132], 99.95th=[  161],
     | 99.99th=[  215]
   bw (  KiB/s): min=13728, max=35240, per=100.00%, avg=24989.94, stdev=1335.23, samples=478
   iops        : min= 3432, max= 8810, avg=6247.33, stdev=333.81, samples=478
  lat (usec)   : 4=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=1.84%, 20=71.58%, 50=22.84%
  lat (msec)   : 100=3.49%, 250=0.27%, 500=0.01%
  cpu          : usr=0.31%, sys=1.53%, ctx=744852, majf=0, minf=249
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,375300,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
rand_read_4k: (groupid=3, jobs=4): err= 0: pid=3857680: Thu Apr  2 19:22:10 2026
  read: IOPS=552, BW=2209KiB/s (2263kB/s)(64.8MiB/30016msec)
    slat (usec): min=196, max=138719, avg=7234.86, stdev=5848.04
    clat (msec): min=129, max=608, avg=224.56, stdev=43.39
     lat (msec): min=133, max=610, avg=231.80, stdev=44.25
    clat percentiles (msec):
     |  1.00th=[  153],  5.00th=[  167], 10.00th=[  178], 20.00th=[  190],
     | 30.00th=[  203], 40.00th=[  211], 50.00th=[  222], 60.00th=[  230],
     | 70.00th=[  241], 80.00th=[  253], 90.00th=[  271], 95.00th=[  288],
     | 99.00th=[  380], 99.50th=[  426], 99.90th=[  592], 99.95th=[  600],
     | 99.99th=[  609]
   bw (  KiB/s): min= 1512, max= 2729, per=100.00%, avg=2210.62, stdev=59.24, samples=237
   iops        : min=  378, max=  682, avg=552.64, stdev=14.81, samples=237
  lat (msec)   : 250=77.77%, 500=21.96%, 750=0.25%
  cpu          : usr=0.10%, sys=0.44%, ctx=22320, majf=0, minf=232
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=16588,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=74.5MiB/s (78.1MB/s), 74.5MiB/s-74.5MiB/s (78.1MB/s-78.1MB/s), io=16.5GiB (17.7GB), run=226283-226283msec

Run status group 1 (all jobs):
   READ: bw=92.9MiB/s (97.4MB/s), 92.9MiB/s-92.9MiB/s (97.4MB/s-97.4MB/s), io=14.6GiB (15.7GB), run=160832-160832msec

Run status group 2 (all jobs):
  WRITE: bw=15.4MiB/s (16.1MB/s), 15.4MiB/s-15.4MiB/s (16.1MB/s-16.1MB/s), io=1467MiB (1538MB), run=95377-95377msec

Run status group 3 (all jobs):
   READ: bw=2209KiB/s (2263kB/s), 2209KiB/s-2209KiB/s (2263kB/s-2263kB/s), io=64.8MiB (67.9MB), run=30016-30016msec

seq_write: (groupid=0, jobs=4): err= 0: pid=3854281: Thu Apr  2 19:22:40 2026
  write: IOPS=65, BW=65.7MiB/s (68.9MB/s)(16.5GiB/256284msec); 0 zone resets
    slat (msec): min=6, max=127, avg=14.34, stdev= 2.42
    clat (usec): min=5, max=626112, avg=443257.52, stdev=27912.65
     lat (msec): min=6, max=639, avg=457.60, stdev=28.09
    clat percentiles (msec):
     |  1.00th=[  409],  5.00th=[  435], 10.00th=[  439], 20.00th=[  439],
     | 30.00th=[  443], 40.00th=[  443], 50.00th=[  443], 60.00th=[  443],
     | 70.00th=[  447], 80.00th=[  447], 90.00th=[  451], 95.00th=[  456],
     | 99.00th=[  514], 99.50th=[  584], 99.90th=[  625], 99.95th=[  625],
     | 99.99th=[  625]
   bw (  KiB/s): min=225280, max=384980, per=100.00%, avg=286155.25, stdev=3613.06, samples=478
   iops        : min=  220, max=  375, avg=279.37, stdev= 3.51, samples=478
  lat (usec)   : 10=0.02%, 20=0.01%
  lat (msec)   : 10=0.01%, 20=0.02%, 50=0.05%, 100=0.08%, 250=0.26%
  lat (msec)   : 500=99.09%, 750=1.21%
  cpu          : usr=0.08%, sys=0.65%, ctx=764597, majf=0, minf=252
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,16722,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
seq_read: (groupid=1, jobs=4): err= 0: pid=3855468: Thu Apr  2 19:22:40 2026
  read: IOPS=77, BW=78.3MiB/s (82.1MB/s)(14.6GiB/190833msec)
    slat (msec): min=5, max=185, avg=16.19, stdev=14.71
    clat (usec): min=3, max=910787, avg=500535.48, stdev=95630.70
     lat (msec): min=6, max=923, avg=516.73, stdev=97.36
    clat percentiles (msec):
     |  1.00th=[  326],  5.00th=[  372], 10.00th=[  393], 20.00th=[  422],
     | 30.00th=[  447], 40.00th=[  468], 50.00th=[  493], 60.00th=[  514],
     | 70.00th=[  542], 80.00th=[  575], 90.00th=[  625], 95.00th=[  667],
     | 99.00th=[  768], 99.50th=[  802], 99.90th=[  844], 99.95th=[  869],
     | 99.99th=[  902]
   bw (  KiB/s): min=139264, max=356352, per=100.00%, avg=252716.58, stdev=10785.48, samples=476
   iops        : min=  136, max=  348, avg=246.74, stdev=10.53, samples=476
  lat (usec)   : 4=0.01%, 10=0.02%
  lat (msec)   : 10=0.01%, 20=0.02%, 50=0.05%, 100=0.10%, 250=0.25%
  lat (msec)   : 500=53.26%, 750=45.66%, 1000=1.45%
  cpu          : usr=0.02%, sys=2.94%, ctx=8084437, majf=0, minf=258
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=14806,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
rand_write_4k: (groupid=2, jobs=4): err= 0: pid=3856597: Thu Apr  2 19:22:40 2026
  write: IOPS=2993, BW=11.7MiB/s (12.3MB/s)(1467MiB/125378msec); 0 zone resets
    slat (usec): min=117, max=152898, avg=637.17, stdev=1483.50
    clat (usec): min=2, max=257406, avg=19821.84, stdev=13026.61
     lat (usec): min=276, max=269484, avg=20459.36, stdev=13345.68
    clat percentiles (msec):
     |  1.00th=[   10],  5.00th=[   11], 10.00th=[   12], 20.00th=[   13],
     | 30.00th=[   14], 40.00th=[   15], 50.00th=[   16], 60.00th=[   18],
     | 70.00th=[   20], 80.00th=[   23], 90.00th=[   34], 95.00th=[   46],
     | 99.00th=[   72], 99.50th=[   86], 99.90th=[  132], 99.95th=[  161],
     | 99.99th=[  215]
   bw (  KiB/s): min=13728, max=35240, per=100.00%, avg=24989.94, stdev=1335.23, samples=478
   iops        : min= 3432, max= 8810, avg=6247.33, stdev=333.81, samples=478
  lat (usec)   : 4=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=1.84%, 20=71.58%, 50=22.84%
  lat (msec)   : 100=3.49%, 250=0.27%, 500=0.01%
  cpu          : usr=0.23%, sys=1.16%, ctx=744852, majf=0, minf=249
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,375300,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
rand_read_4k: (groupid=3, jobs=4): err= 0: pid=3857680: Thu Apr  2 19:22:40 2026
  read: IOPS=543, BW=2179KiB/s (2232kB/s)(128MiB/60017msec)
    slat (usec): min=189, max=627479, avg=7349.16, stdev=8785.43
    clat (usec): min=2, max=963754, avg=227559.88, stdev=60410.18
     lat (msec): min=6, max=967, avg=234.91, stdev=61.60
    clat percentiles (msec):
     |  1.00th=[  150],  5.00th=[  167], 10.00th=[  178], 20.00th=[  190],
     | 30.00th=[  201], 40.00th=[  211], 50.00th=[  220], 60.00th=[  230],
     | 70.00th=[  241], 80.00th=[  255], 90.00th=[  275], 95.00th=[  300],
     | 99.00th=[  451], 99.50th=[  584], 99.90th=[  869], 99.95th=[  902],
     | 99.99th=[  953]
   bw (  KiB/s): min=  336, max= 2801, per=99.80%, avg=2175.60, stdev=85.64, samples=476
   iops        : min=   84, max=  700, avg=543.86, stdev=21.41, samples=476
  lat (usec)   : 4=0.01%, 10=0.01%
  lat (msec)   : 10=0.01%, 20=0.01%, 50=0.06%, 100=0.09%, 250=77.12%
  lat (msec)   : 500=22.20%, 750=0.59%, 1000=0.28%
  cpu          : usr=0.09%, sys=0.41%, ctx=45036, majf=0, minf=246
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=32636,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=65.7MiB/s (68.9MB/s), 65.7MiB/s-65.7MiB/s (68.9MB/s-68.9MB/s), io=16.5GiB (17.7GB), run=256284-256284msec

Run status group 1 (all jobs):
   READ: bw=78.3MiB/s (82.1MB/s), 78.3MiB/s-78.3MiB/s (82.1MB/s-82.1MB/s), io=14.6GiB (15.7GB), run=190833-190833msec

Run status group 2 (all jobs):
  WRITE: bw=11.7MiB/s (12.3MB/s), 11.7MiB/s-11.7MiB/s (12.3MB/s-12.3MB/s), io=1467MiB (1538MB), run=125378-125378msec

Run status group 3 (all jobs):
   READ: bw=2179KiB/s (2232kB/s), 2179KiB/s-2179KiB/s (2232kB/s-2232kB/s), io=128MiB (134MB), run=60017-60017msec

seq_write: (groupid=0, jobs=4): err= 0: pid=3854281: Thu Apr  2 19:22:40 2026
  write: IOPS=278, BW=280MiB/s (294MB/s)(16.5GiB/60102msec); 0 zone resets
    slat (msec): min=6, max=127, avg=14.34, stdev= 2.42
    clat (usec): min=5, max=626112, avg=443257.52, stdev=27912.65
     lat (msec): min=6, max=639, avg=457.60, stdev=28.09
    clat percentiles (msec):
     |  1.00th=[  409],  5.00th=[  435], 10.00th=[  439], 20.00th=[  439],
     | 30.00th=[  443], 40.00th=[  443], 50.00th=[  443], 60.00th=[  443],
     | 70.00th=[  447], 80.00th=[  447], 90.00th=[  451], 95.00th=[  456],
     | 99.00th=[  514], 99.50th=[  584], 99.90th=[  625], 99.95th=[  625],
     | 99.99th=[  625]
   bw (  KiB/s): min=225280, max=384980, per=99.68%, avg=286155.25, stdev=3613.06, samples=478
   iops        : min=  220, max=  375, avg=279.37, stdev= 3.51, samples=478
  lat (usec)   : 10=0.02%, 20=0.01%
  lat (msec)   : 10=0.01%, 20=0.02%, 50=0.05%, 100=0.08%, 250=0.26%
  lat (msec)   : 500=99.09%, 750=1.21%
  cpu          : usr=0.08%, sys=0.65%, ctx=764597, majf=0, minf=252
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,16722,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
seq_read: (groupid=1, jobs=4): err= 0: pid=3855468: Thu Apr  2 19:22:40 2026
  read: IOPS=246, BW=249MiB/s (261MB/s)(14.6GiB/60065msec)
    slat (msec): min=5, max=185, avg=16.19, stdev=14.71
    clat (usec): min=3, max=910787, avg=500535.48, stdev=95630.70
     lat (msec): min=6, max=923, avg=516.73, stdev=97.36
    clat percentiles (msec):
     |  1.00th=[  326],  5.00th=[  372], 10.00th=[  393], 20.00th=[  422],
     | 30.00th=[  447], 40.00th=[  468], 50.00th=[  493], 60.00th=[  514],
     | 70.00th=[  542], 80.00th=[  575], 90.00th=[  625], 95.00th=[  667],
     | 99.00th=[  768], 99.50th=[  802], 99.90th=[  844], 99.95th=[  869],
     | 99.99th=[  902]
   bw (  KiB/s): min=139264, max=356352, per=99.26%, avg=252716.58, stdev=10785.48, samples=476
   iops        : min=  136, max=  348, avg=246.74, stdev=10.53, samples=476
  lat (usec)   : 4=0.01%, 10=0.02%
  lat (msec)   : 10=0.01%, 20=0.02%, 50=0.05%, 100=0.10%, 250=0.25%
  lat (msec)   : 500=53.26%, 750=45.66%, 1000=1.45%
  cpu          : usr=0.02%, sys=2.94%, ctx=8084437, majf=0, minf=258
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=14806,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
rand_write_4k: (groupid=2, jobs=4): err= 0: pid=3856597: Thu Apr  2 19:22:40 2026
  write: IOPS=6247, BW=24.4MiB/s (25.6MB/s)(1467MiB/60072msec); 0 zone resets
    slat (usec): min=117, max=152898, avg=637.17, stdev=1483.50
    clat (usec): min=2, max=257406, avg=19821.84, stdev=13026.61
     lat (usec): min=276, max=269484, avg=20459.36, stdev=13345.68
    clat percentiles (msec):
     |  1.00th=[   10],  5.00th=[   11], 10.00th=[   12], 20.00th=[   13],
     | 30.00th=[   14], 40.00th=[   15], 50.00th=[   16], 60.00th=[   18],
     | 70.00th=[   20], 80.00th=[   23], 90.00th=[   34], 95.00th=[   46],
     | 99.00th=[   72], 99.50th=[   86], 99.90th=[  132], 99.95th=[  161],
     | 99.99th=[  215]
   bw (  KiB/s): min=13728, max=35240, per=99.96%, avg=24989.94, stdev=1335.23, samples=478
   iops        : min= 3432, max= 8810, avg=6247.33, stdev=333.81, samples=478
  lat (usec)   : 4=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=1.84%, 20=71.58%, 50=22.84%
  lat (msec)   : 100=3.49%, 250=0.27%, 500=0.01%
  cpu          : usr=0.23%, sys=1.16%, ctx=744852, majf=0, minf=249
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,375300,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
rand_read_4k: (groupid=3, jobs=4): err= 0: pid=3857680: Thu Apr  2 19:22:40 2026
  read: IOPS=543, BW=2181KiB/s (2234kB/s)(128MiB/60085msec)
    slat (usec): min=189, max=627479, avg=7349.16, stdev=8785.43
    clat (usec): min=2, max=963754, avg=227559.88, stdev=60410.18
     lat (msec): min=6, max=967, avg=234.91, stdev=61.60
    clat percentiles (msec):
     |  1.00th=[  150],  5.00th=[  167], 10.00th=[  178], 20.00th=[  190],
     | 30.00th=[  201], 40.00th=[  211], 50.00th=[  220], 60.00th=[  230],
     | 70.00th=[  241], 80.00th=[  255], 90.00th=[  275], 95.00th=[  300],
     | 99.00th=[  451], 99.50th=[  584], 99.90th=[  869], 99.95th=[  902],
     | 99.99th=[  953]
   bw (  KiB/s): min=  336, max= 2808, per=99.85%, avg=2178.01, stdev=86.01, samples=478
   iops        : min=   84, max=  702, avg=544.45, stdev=21.50, samples=478
  lat (usec)   : 4=0.01%, 10=0.01%
  lat (msec)   : 10=0.01%, 20=0.01%, 50=0.06%, 100=0.09%, 250=77.12%
  lat (msec)   : 500=22.20%, 750=0.59%, 1000=0.28%
  cpu          : usr=0.09%, sys=0.41%, ctx=45180, majf=0, minf=248
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=32636,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=280MiB/s (294MB/s), 280MiB/s-280MiB/s (294MB/s-294MB/s), io=16.5GiB (17.7GB), run=60102-60102msec

Run status group 1 (all jobs):
   READ: bw=249MiB/s (261MB/s), 249MiB/s-249MiB/s (261MB/s-261MB/s), io=14.6GiB (15.7GB), run=60065-60065msec

Run status group 2 (all jobs):
  WRITE: bw=24.4MiB/s (25.6MB/s), 24.4MiB/s-24.4MiB/s (25.6MB/s-25.6MB/s), io=1467MiB (1538MB), run=60072-60072msec

Run status group 3 (all jobs):
   READ: bw=2181KiB/s (2234kB/s), 2181KiB/s-2181KiB/s (2234kB/s-2234kB/s), io=128MiB (134MB), run=60085-60085msec

── Summary ───────────────────────────────────────────
  seq_write: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=32
  seq_read: (g=1): rw=read, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=32
  seq_write: Laying out IO file (1 file / 1024MiB)
  seq_write: Laying out IO file (1 file / 1024MiB)
  seq_write: Laying out IO file (1 file / 1024MiB)
[...]
  seq_read: Laying out IO file (1 file / 1024MiB)
  seq_read: Laying out IO file (1 file / 1024MiB)
  seq_read: Laying out IO file (1 file / 1024MiB)
[...]
  seq_write: (groupid=0, jobs=4): err= 0: pid=3854281: Thu Apr  2 19:18:53 2026
  write: IOPS=279, BW=279MiB/s (293MB/s)(8372MiB/30008msec); 0 zone resets
  WRITE: bw=279MiB/s (293MB/s), 279MiB/s-279MiB/s (293MB/s-293MB/s), io=8372MiB (8779MB), run=30008-30008msec
  seq_write: (groupid=0, jobs=4): err= 0: pid=3854281: Thu Apr  2 19:19:23 2026
  write: IOPS=278, BW=280MiB/s (293MB/s)(16.4GiB/60009msec); 0 zone resets
  WRITE: bw=280MiB/s (293MB/s), 280MiB/s-280MiB/s (293MB/s-293MB/s), io=16.4GiB (17.6GB), run=60009-60009msec
  seq_write: (groupid=0, jobs=4): err= 0: pid=3854281: Thu Apr  2 19:19:59 2026
  write: IOPS=175, BW=176MiB/s (185MB/s)(16.5GiB/95491msec); 0 zone resets
  seq_read: (groupid=1, jobs=4): err= 0: pid=3855468: Thu Apr  2 19:19:59 2026
  read: IOPS=246, BW=246MiB/s (258MB/s)(7377MiB/30040msec)
  WRITE: bw=176MiB/s (185MB/s), 176MiB/s-176MiB/s (185MB/s-185MB/s), io=16.5GiB (17.7GB), run=95491-95491msec
  READ: bw=246MiB/s (258MB/s), 246MiB/s-246MiB/s (258MB/s-258MB/s), io=7377MiB (7735MB), run=30040-30040msec
  seq_write: (groupid=0, jobs=4): err= 0: pid=3854281: Thu Apr  2 19:20:29 2026
  write: IOPS=133, BW=134MiB/s (141MB/s)(16.5GiB/125491msec); 0 zone resets
  seq_read: (groupid=1, jobs=4): err= 0: pid=3855468: Thu Apr  2 19:20:29 2026
  read: IOPS=246, BW=248MiB/s (260MB/s)(14.6GiB/60040msec)
  WRITE: bw=134MiB/s (141MB/s), 134MiB/s-134MiB/s (141MB/s-141MB/s), io=16.5GiB (17.7GB), run=125491-125491msec
  READ: bw=248MiB/s (260MB/s), 248MiB/s-248MiB/s (260MB/s-260MB/s), io=14.6GiB (15.6GB), run=60040-60040msec
  seq_write: (groupid=0, jobs=4): err= 0: pid=3854281: Thu Apr  2 19:21:04 2026
  write: IOPS=103, BW=105MiB/s (110MB/s)(16.5GiB/160909msec); 0 zone resets
  seq_read: (groupid=1, jobs=4): err= 0: pid=3855468: Thu Apr  2 19:21:04 2026
  read: IOPS=155, BW=156MiB/s (164MB/s)(14.6GiB/95458msec)
  write: IOPS=6222, BW=24.3MiB/s (25.5MB/s)(729MiB/30002msec); 0 zone resets
  WRITE: bw=105MiB/s (110MB/s), 105MiB/s-105MiB/s (110MB/s-110MB/s), io=16.5GiB (17.7GB), run=160909-160909msec
  READ: bw=156MiB/s (164MB/s), 156MiB/s-156MiB/s (164MB/s-164MB/s), io=14.6GiB (15.7GB), run=95458-95458msec
  WRITE: bw=24.3MiB/s (25.5MB/s), 24.3MiB/s-24.3MiB/s (25.5MB/s-25.5MB/s), io=729MiB (765MB), run=30002-30002msec
  seq_write: (groupid=0, jobs=4): err= 0: pid=3854281: Thu Apr  2 19:21:34 2026
  write: IOPS=87, BW=88.3MiB/s (92.5MB/s)(16.5GiB/190908msec); 0 zone resets
  seq_read: (groupid=1, jobs=4): err= 0: pid=3855468: Thu Apr  2 19:21:34 2026
  read: IOPS=118, BW=119MiB/s (125MB/s)(14.6GiB/125458msec)
  write: IOPS=6254, BW=24.4MiB/s (25.6MB/s)(1466MiB/60003msec); 0 zone resets
  WRITE: bw=88.3MiB/s (92.5MB/s), 88.3MiB/s-88.3MiB/s (92.5MB/s-92.5MB/s), io=16.5GiB (17.7GB), run=190908-190908msec
  READ: bw=119MiB/s (125MB/s), 119MiB/s-119MiB/s (125MB/s-125MB/s), io=14.6GiB (15.7GB), run=125458-125458msec
  WRITE: bw=24.4MiB/s (25.6MB/s), 24.4MiB/s-24.4MiB/s (25.6MB/s-25.6MB/s), io=1466MiB (1537MB), run=60003-60003msec
  seq_write: (groupid=0, jobs=4): err= 0: pid=3854281: Thu Apr  2 19:22:10 2026
  write: IOPS=73, BW=74.5MiB/s (78.1MB/s)(16.5GiB/226283msec); 0 zone resets
  seq_read: (groupid=1, jobs=4): err= 0: pid=3855468: Thu Apr  2 19:22:10 2026
  read: IOPS=92, BW=92.9MiB/s (97.4MB/s)(14.6GiB/160832msec)
  write: IOPS=3934, BW=15.4MiB/s (16.1MB/s)(1467MiB/95377msec); 0 zone resets
  read: IOPS=552, BW=2209KiB/s (2263kB/s)(64.8MiB/30016msec)
  WRITE: bw=74.5MiB/s (78.1MB/s), 74.5MiB/s-74.5MiB/s (78.1MB/s-78.1MB/s), io=16.5GiB (17.7GB), run=226283-226283msec
  READ: bw=92.9MiB/s (97.4MB/s), 92.9MiB/s-92.9MiB/s (97.4MB/s-97.4MB/s), io=14.6GiB (15.7GB), run=160832-160832msec
  WRITE: bw=15.4MiB/s (16.1MB/s), 15.4MiB/s-15.4MiB/s (16.1MB/s-16.1MB/s), io=1467MiB (1538MB), run=95377-95377msec
  READ: bw=2209KiB/s (2263kB/s), 2209KiB/s-2209KiB/s (2263kB/s-2263kB/s), io=64.8MiB (67.9MB), run=30016-30016msec
  seq_write: (groupid=0, jobs=4): err= 0: pid=3854281: Thu Apr  2 19:22:40 2026
  write: IOPS=65, BW=65.7MiB/s (68.9MB/s)(16.5GiB/256284msec); 0 zone resets
  seq_read: (groupid=1, jobs=4): err= 0: pid=3855468: Thu Apr  2 19:22:40 2026
  read: IOPS=77, BW=78.3MiB/s (82.1MB/s)(14.6GiB/190833msec)
  write: IOPS=2993, BW=11.7MiB/s (12.3MB/s)(1467MiB/125378msec); 0 zone resets
  read: IOPS=543, BW=2179KiB/s (2232kB/s)(128MiB/60017msec)
  WRITE: bw=65.7MiB/s (68.9MB/s), 65.7MiB/s-65.7MiB/s (68.9MB/s-68.9MB/s), io=16.5GiB (17.7GB), run=256284-256284msec
  READ: bw=78.3MiB/s (82.1MB/s), 78.3MiB/s-78.3MiB/s (82.1MB/s-82.1MB/s), io=14.6GiB (15.7GB), run=190833-190833msec
  WRITE: bw=11.7MiB/s (12.3MB/s), 11.7MiB/s-11.7MiB/s (12.3MB/s-12.3MB/s), io=1467MiB (1538MB), run=125378-125378msec
  READ: bw=2179KiB/s (2232kB/s), 2179KiB/s-2179KiB/s (2232kB/s-2232kB/s), io=128MiB (134MB), run=60017-60017msec
  seq_write: (groupid=0, jobs=4): err= 0: pid=3854281: Thu Apr  2 19:22:40 2026
  write: IOPS=278, BW=280MiB/s (294MB/s)(16.5GiB/60102msec); 0 zone resets
  seq_read: (groupid=1, jobs=4): err= 0: pid=3855468: Thu Apr  2 19:22:40 2026
  read: IOPS=246, BW=249MiB/s (261MB/s)(14.6GiB/60065msec)
  write: IOPS=6247, BW=24.4MiB/s (25.6MB/s)(1467MiB/60072msec); 0 zone resets
  read: IOPS=543, BW=2181KiB/s (2234kB/s)(128MiB/60085msec)
  WRITE: bw=280MiB/s (294MB/s), 280MiB/s-280MiB/s (294MB/s-294MB/s), io=16.5GiB (17.7GB), run=60102-60102msec
  READ: bw=249MiB/s (261MB/s), 249MiB/s-249MiB/s (261MB/s-261MB/s), io=14.6GiB (15.7GB), run=60065-60065msec
  WRITE: bw=24.4MiB/s (25.6MB/s), 24.4MiB/s-24.4MiB/s (25.6MB/s-25.6MB/s), io=1467MiB (1538MB), run=60072-60072msec
  READ: bw=2181KiB/s (2234kB/s), 2181KiB/s-2181KiB/s (2234kB/s-2234kB/s), io=128MiB (134MB), run=60085-60085msec